ujfadndna/arm-pharmacy-robot/LED_RTOS_keil/src/w800_driver.c
/**
 ******************************************************************************
 * @file    w800_driver.c
 * @brief   W800 WiFi模块驱动 - 直接UART协议版本 (v2.0)
 * @note    配合W800自定义固�?(wm_llm_demo.c UART命令接口)
 *
 * 协议说明:
 *   RA6M5 �?W800:
 *     LLM:<query>\r\n       发起LLM查询
 *     WIFI:<ssid>,<pwd>\r\n 连接WiFi
 *     STATUS\r\n            查询状�?
 *
 *   W800 �?RA6M5:
 *     OK:<response>\r\n     成功响应
 *     ERR:<code>\r\n        错误响应
 *     READY/BUSY/NO_WIFI   状态响�?
 *
 * 错误�?
 *   -1: 内存分配失败
 *  
 -2: DNS解析失败
 *   -3: Socket创建失败
 *   -4: SSL连接失败
 *   -5: 请求体构造失�?
 *   -6: HTTP请求构造失�?
 *   -7: 发送失�?
 *   -8: 响应解析失败
 *   -9: 无HTTP响应�?
 *   -100: WiFi未连�?
 *   -101: 正在�?
 *   -102: 参数格式错误
 *   -103: 未知命令
 ******************************************************************************
 */

#include "w800_driver.h"
#include "hal_data.h"
#include "new_thread0.h"
#include "debug_uart.h"
#include "r_sci_uart.h"
#include "r_ioport.h"
#include "watchdog.h"
#include "w800_cmd_handler.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include <string.h>
#include <stdio.h>
#include "maixcam_uart.h"

/* ========== 配置 ========== */
#define W800_UART_TIMEOUT_MS    30000   /* LLM查询超时 (30�? */
#define W800_WIFI_TIMEOUT_MS    15000   /* WiFi连接超时 */
#define W800_STATUS_TIMEOUT_MS  1000    /* 状态查询超�?*/

/* W800 RESET引脚 (P508) */
#define W800_RESET_PIN          BSP_IO_PORT_05_PIN_08

/* 命令前缀 */
#define CMD_PREFIX_LLM          "LLM:"
#define CMD_PREFIX_WIFI         "WIFI:"
#define CMD_PREFIX_STATE        "STATE:"    /* v2.1: 药柜状态命�?*/
#define CMD_STATUS              "STATUS"

/* 响应前缀 */
#define RSP_OK                  "OK:"
#define RSP_ERR                 "ERR:"
#define RSP_READY               "READY"
#define RSP_BUSY                "BUSY"
#define RSP_NO_WIFI             "NO_WIFI"
#define RSP_WIFI_CONNECTING     "WIFI_CONNECTING"
#define RSP_STATE_OK            "STATE_OK"  /* v2.1: 状态设置成�?*/

/* ========== 内部状�?========== */
typedef enum {
    W800_IDLE,
    W800_WAITING_RESPONSE,
    W800_WIFI_CONNECTING
} w800_internal_state_t;

static w800_internal_state_t g_internal_state = W800_IDLE;

/* 接收缓冲 */
#define RX_BUFFER_SIZE  2048
static uint8_t g_rx_buffer[RX_BUFFER_SIZE];
static uint16_t g_rx_idx = 0;

/* 行缓�?(用于检测\r\n结尾的完整响�? */
static char g_line_buffer[RX_BUFFER_SIZE];
static uint16_t g_line_idx = 0;
static volatile bool g_line_complete = false;
/* 已完成行缓冲 (�?send_cmd_wait_response 读取，与 g_line_buffer 分离) */
static char g_completed_line_buf[RX_BUFFER_SIZE];
static bool g_line_is_json_cmd = false;

/*
 * JSON命令队列:
 * OpenClaw 侧可能连续发送多条命令，单缓冲会造成后到命令被覆盖�?
 * 这里使用小型环形队列缓存整行JSON，任务上下文中依次派发�?
 */
#define JSON_CMD_MAX_LEN          512U
#define JSON_CMD_QUEUE_DEPTH      8U
static char g_json_cmd_queue[JSON_CMD_QUEUE_DEPTH][JSON_CMD_MAX_LEN];
static volatile uint8_t g_json_cmd_head = 0U;
static volatile uint8_t g_json_cmd_tail = 0U;
static volatile uint8_t g_json_cmd_count = 0U;
static volatile uint32_t g_json_cmd_drop_count = 0U;

/* 发送完成标�?*/
static volatile bool g_uart_tx_complete = true;

/* UART6 TX 互斥�?*/
static SemaphoreHandle_t g_uart_tx_mutex = NULL;

/* W800上报IP标志 (收到 "IP:..." 行时置位) */
static volatile bool g_w800_got_ip = false;

/* ISR-safe 通知：IP通知延迟到主循环打印 (避免ISR中调用debug_print) */
static volatile bool g_notify_got_ip = false;
static char g_notify_ip_str[48];

/* 回调函数 */
static w800_data_callback_t g_data_callback = NULL;

/* ========== UART发�?========== */

static void json_cmd_queue_reset(void)
{
    taskENTER_CRITICAL();
    g_json_cmd_head = 0U;
    g_json_cmd_tail = 0U;
    g_json_cmd_count = 0U;
    g_json_cmd_drop_count = 0U;
    memset(g_json_cmd_queue, 0, sizeof(g_json_cmd_queue));
    taskEXIT_CRITICAL();
}

/*
 * 在UART回调上下文中调用，只做轻量入队，不做阻塞动作�?
 */
static void json_cmd_queue_push(const char *line, uint16_t line_len)
{
    uint16_t copy_len;
    uint8_t tail;

    if ((line == NULL) || (line_len == 0U)) {
        return;
    }

    if (g_json_cmd_count >= JSON_CMD_QUEUE_DEPTH) {
        g_json_cmd_drop_count++;
        return;
    }

    copy_len = line_len;
    if (copy_len >= JSON_CMD_MAX_LEN) {
        copy_len = (uint16_t)(JSON_CMD_MAX_LEN - 1U);
    }

    tail = g_json_cmd_tail;
    memcpy(g_json_cmd_queue[tail], line, copy_len);
    g_json_cmd_queue[tail][copy_len] = '\0';

    tail++;
    if (tail >= JSON_CMD_QUEUE_DEPTH) {
        tail = 0U;
    }
    g_json_cmd_tail = tail;
    g_json_cmd_count++;
}

static bool json_cmd_queue_pop(char *line, uint32_t line_size)
{
    bool has_cmd = false;

    if ((line == NULL) || (line_size == 0U)) {
        return false;
    }

    taskENTER_CRITICAL();
    if (g_json_cmd_count > 0U) {
        uint8_t head = g_json_cmd_head;
        uint32_t len = strlen(g_json_cmd_queue[head]);

        if (len >= line_size) {
            len = line_size - 1U;
        }

        memcpy(line, g_json_cmd_queue[head], len);
        line[len] = '\0';
        g_json_cmd_queue[head][0] = '\0';

        head++;
        if (head >= JSON_CMD_QUEUE_DEPTH) {
            head = 0U;
        }

        g_json_cmd_head = head;
        g_json_cmd_count--;
        has_cmd = true;
    }
    taskEXIT_CRITICAL();

    return has_cmd;
}

static uint32_t json_cmd_take_drop_count(void)
{
    uint32_t dropped;

    taskENTER_CRITICAL();
    dropped = g_json_cmd_drop_count;
    g_json_cmd_drop_count = 0U;
    taskEXIT_CRITICAL();

    return dropped;
}

static void wait_tx_complete(void)
{
    uint32_t timeout = 1000;
    while (!g_uart_tx_complete && timeout > 0) {
        vTaskDelay(pdMS_TO_TICKS(1));
        timeout--;
    }
}

static int uart_send(const char *str)
{
    int result = -1;
    uint32_t len = strlen(str);

    if (g_uart_tx_mutex != NULL) {
        if (xSemaphoreTake(g_uart_tx_mutex, pdMS_TO_TICKS(2000)) != pdTRUE) {
            return -1;  /* 超时，避免死锁 */
        }
    }

    g_uart_tx_complete = false;
    fsp_err_t err = R_SCI_UART_Write(&g_uart6_ctrl, (uint8_t *)str, len);
    if (err == FSP_SUCCESS) {
        wait_tx_complete();
        result = 0;
    }

    if (g_uart_tx_mutex != NULL) {
        xSemaphoreGive(g_uart_tx_mutex);
    }
    return result;
}

/* ========== 接收处理 ========== */

/**
 * @brief 清空接收缓冲�?
 */
static void clear_rx_buffer(void)
{
    taskENTER_CRITICAL();
    g_rx_idx = 0;
    g_line_idx = 0;
    g_line_complete = false;
    g_line_is_json_cmd = false;
    memset(g_rx_buffer, 0, sizeof(g_rx_buffer));
    memset(g_line_buffer, 0, sizeof(g_line_buffer));
    memset(g_completed_line_buf, 0, sizeof(g_completed_line_buf));
    taskEXIT_CRITICAL();
}

/**
 * @brief 判断是否为协议层有效响应�?
 */
static bool is_expected_response_line(const char *line)
{
    if (line == NULL) {
        return false;
    }

    if (strncmp(line, RSP_OK, strlen(RSP_OK)) == 0) {
        return true;
    }
    if (strncmp(line, RSP_ERR, strlen(RSP_ERR)) == 0) {
        return true;
    }
    if (strcmp(line, RSP_READY) == 0) {
        return true;
    }
    if (strcmp(line, RSP_BUSY) == 0) {
        return true;
    }
    if (strcmp(line, RSP_NO_WIFI) == 0) {
        return true;
    }

