ujfadndna/arm-pharmacy-robot/LED_RTOS_keil/src/w800_driver.c
    return false;
}

/**
 * @brief 取出一条已完成响应行（原子消费�?
 * @param line 输出缓冲�?
 * @param line_size 缓冲区大�?
 * @return true=取到一�? false=当前无完整行
 */
static bool take_completed_line(char *line, uint32_t line_size)
{
    bool has_line = false;

    if ((line == NULL) || (line_size == 0U)) {
        return false;
    }

    taskENTER_CRITICAL();
    if (g_line_complete) {
        uint32_t len = strlen(g_completed_line_buf);
        if (len >= line_size) {
            len = line_size - 1U;
        }
        memcpy(line, g_completed_line_buf, len);
        line[len] = '\0';

        g_line_complete = false;
        g_completed_line_buf[0] = '\0';
        has_line = true;
    }
    taskEXIT_CRITICAL();

    return has_line;
}

/**
 * @brief 发送命令并等待响应
 * @param cmd 命令字符�?(不含\r\n)
 * @param response 响应缓冲�?
 * @param resp_size 缓冲区大�?
 * @param timeout_ms 超时时间
 * @return 响应长度, 负数=错误
 */
static int send_cmd_wait_response(const char *cmd, char *response,
                                   uint32_t resp_size, uint32_t timeout_ms)
{
    char cmd_buf[256];
    char line[RX_BUFFER_SIZE];
    TickType_t start_tick;
    uint32_t refresh_cnt = 0;

    /* 清空接收缓冲 */
    clear_rx_buffer();

    /* 构造命�?(添加\r\n) */
    snprintf(cmd_buf, sizeof(cmd_buf), "%s\r\n", cmd);

    debug_print("[W800] TX: ");
    debug_println(cmd_buf);

    /* 发送命�?*/
    if (uart_send(cmd_buf) != 0) {
        debug_println("[W800] UART send failed!");
        return -1;
    }

    /* 等待并筛选有效响应行 */
    start_tick = xTaskGetTickCount();
    while ((xTaskGetTickCount() - start_tick) < pdMS_TO_TICKS(timeout_ms)) {
        if (take_completed_line(line, sizeof(line))) {
            if (is_expected_response_line(line)) {
                uint32_t len = strlen(line);
                if (len >= resp_size) {
                    len = resp_size - 1U;
                }
                memcpy(response, line, len);
                response[len] = '\0';

                debug_print("[W800] RX: ");
                debug_println(response);

                return (int)len;
            }

            /* 丢弃 DBG/噪声等非协议行，继续等待有效应答 */
            debug_print("[W800] Skip non-protocol line: ");
            debug_println(line);
        }

        vTaskDelay(pdMS_TO_TICKS(10));
        if (++refresh_cnt >= 200U) {
            watchdog_refresh();
            refresh_cnt = 0U;
        }
    }

    debug_println("[W800] Response timeout!");
    return -2;
}

/* ========== 公共接口 ========== */

void w800_init(w800_data_callback_t on_data)
{
    g_data_callback = on_data;
    g_internal_state = W800_IDLE;
    g_rx_idx = 0;
    g_line_idx = 0;
    g_line_complete = false;
    g_line_is_json_cmd = false;
    g_uart_tx_complete = true;
    memset(g_rx_buffer, 0, sizeof(g_rx_buffer));
    memset(g_line_buffer, 0, sizeof(g_line_buffer));
    memset(g_completed_line_buf, 0, sizeof(g_completed_line_buf));
    json_cmd_queue_reset();

    if (g_uart_tx_mutex == NULL) {
        g_uart_tx_mutex = xSemaphoreCreateMutex();
    }

    debug_println("[W800] Driver initialized (Direct UART Protocol v2.0)");
}

/**
 * @brief 查询W800状�?
 * @return W800_STATUS_READY, W800_STATUS_BUSY, W800_STATUS_NO_WIFI, 或负数错�?
 */
/* 内部工具：支持自定义超时的 STATUS 查询 */
static w800_status_t w800_get_status_with_timeout(uint32_t timeout_ms)
{
    char response[64];

    int ret = send_cmd_wait_response(CMD_STATUS, response, sizeof(response),
                                     timeout_ms);
    if (ret < 0) {
        return W800_STATUS_ERROR;
    }

    if (strstr(response, RSP_READY)) {
        return W800_STATUS_READY;
    } else if (strstr(response, RSP_BUSY)) {
        return W800_STATUS_BUSY;
    } else if (strstr(response, RSP_NO_WIFI)) {
        return W800_STATUS_NO_WIFI;
    }

    return W800_STATUS_ERROR;
}

w800_status_t w800_get_status(void)
{
    return w800_get_status_with_timeout(W800_STATUS_TIMEOUT_MS);
}

/**
 * @brief 连接WiFi (通过W800固件，非阻塞)
 * @param ssid WiFi名称
 * @param password WiFi密码
 * @return 0=命令已接受并开始连接, 负数=错误
 */
int w800_connect_wifi_direct(const char *ssid, const char *password)
{
    char cmd[128];
    char response[64];

    if (!ssid || !password) {
        return -1;
    }

    debug_print("[W800] Connecting to WiFi: ");
    debug_println(ssid);

    /* 构造WiFi命令 */
    snprintf(cmd, sizeof(cmd), "%s%s,%s", CMD_PREFIX_WIFI, ssid, password);

    /* 发送命令并等待首个响应，仅用于确认命令是否被接受 */
    int ret = send_cmd_wait_response(cmd, response, sizeof(response),
                                     W800_WIFI_TIMEOUT_MS);
    if (ret < 0) {
        return ret;
    }

    /* 成功响应: OK:WIFI_CONNECTING */
    if (strstr(response, RSP_OK) && strstr(response, RSP_WIFI_CONNECTING)) {
        debug_println("[W800] WiFi connecting (non-blocking)...");

        /* 清掉旧的 IP 标志，等待新一轮连接完成后由固件上报 */
        g_w800_got_ip = false;
        return 0;
    }

    /* 错误响应: ERR:<code> */
    if (strstr(response, RSP_ERR)) {
        char *p = strstr(response, RSP_ERR);
        if (p) {
            p += strlen(RSP_ERR);
            int err_code = atoi(p);
            debug_print("[W800] WiFi error: ");
            debug_print_int(err_code);
            debug_println("");
            return -err_code;
        }
        return -2;
    }

    /* 未知响应格式 */
    debug_println("[W800] Unknown WiFi connect response");
    return -1;
}

/**
 * @brief 调用云端LLM (通过W800固件直连)
 * @param query 用户查询
 * @param response 响应缓冲�?
 * @param resp_size 缓冲区大�?
 * @return 响应长度, 负数=错误
 */
int w800_call_llm(const char *query, char *response, uint32_t resp_size)
{
    char cmd[256];
    static char raw_response[1024];  /* 改为static，避免栈溢出 */

    if (!query || !response) {
        return -1;
    }

    debug_println("[W800] ========== LLM Query ==========");
    debug_print("[W800] Query: ");
    debug_println(query);

    /* 构造LLM命令 */
    snprintf(cmd, sizeof(cmd), "%s%s", CMD_PREFIX_LLM, query);

    /* 发送命令并等待响应 */
    int ret = send_cmd_wait_response(cmd, raw_response, sizeof(raw_response),
                                      W800_UART_TIMEOUT_MS);
    if (ret < 0) {
        debug_print("[W800] LLM query failed: ");
        debug_print_int(ret);
        debug_println("");
        return ret;
    }

    /* 解析响应 */
    if (strncmp(raw_response, RSP_OK, strlen(RSP_OK)) == 0) {
        /* 成功响应: OK:<content> */
        char *content = raw_response + strlen(RSP_OK);
        uint32_t content_len = strlen(content);
        if (content_len >= resp_size) content_len = resp_size - 1;
        memcpy(response, content, content_len);
        response[content_len] = '\0';

        debug_println("[W800] LLM response received:");
        debug_println(response);
        debug_println("[W800] ================================");

        return (int)content_len;
    } else if (strncmp(raw_response, RSP_ERR, strlen(RSP_ERR)) == 0) {
        /* 错误响应: ERR:<code> */
        char *p = raw_response + strlen(RSP_ERR);
        int err_code = atoi(p);
        debug_print("[W800] LLM error: ");
        debug_print_int(err_code);
        debug_println("");
        return -err_code;
    }

    debug_println("[W800] Unknown response format");
    return -1;
}

/**
 * @brief 调用LLM (带重�?
 */
int w800_call_llm_with_retry(const char *query, char *response,
                              uint32_t resp_size, int max_retries)
{
    for (int i = 0; i < max_retries; i++) {
        if (i > 0) {
            debug_print("[W800] Retry ");
            debug_print_int(i);
            debug_println("...");
            vTaskDelay(pdMS_TO_TICKS(2000));
        }

        int ret = w800_call_llm(query, response, resp_size);
        if (ret > 0) {
            return ret;
        }

        /* 检查是否是"正在�?错误，等待后重试 */
        if (ret == -101) {
            vTaskDelay(pdMS_TO_TICKS(5000));
        }
    }
    return -1;
}

/**
 * @brief 设置药柜状�?(v2.1)
 * @param state 药柜状态字符串 (�?cabinet_serialize_state 生成)
 * @return 0=成功, 负数=错误
 */
int w800_set_cabinet_state(const char *state)
{
    char cmd[512];
    char response[64];

