ujfadndna/arm-pharmacy-robot/LED_RTOS_keil/src/w800_driver.c
    if (!state) {
        return -1;
    }

    debug_println("[W800] Setting cabinet state...");

    /* 构造STATE命令 */
    snprintf(cmd, sizeof(cmd), "%s%s", CMD_PREFIX_STATE, state);

    /* 发送命�?*/
    int ret = send_cmd_wait_response(cmd, response, sizeof(response),
                                      W800_STATUS_TIMEOUT_MS);
    if (ret < 0) {
        debug_print("[W800] Set state failed: ");
        debug_print_int(ret);
        debug_println("");
        return ret;
    }

    /* 检查响�?*/
    if (strstr(response, RSP_OK) && strstr(response, RSP_STATE_OK)) {
        debug_println("[W800] Cabinet state set OK");
        return 0;
    } else if (strstr(response, RSP_ERR)) {
        char *p = strstr(response, RSP_ERR);
        if (p) {
            p += strlen(RSP_ERR);
            int err_code = atoi(p);
            return -err_code;
        }
        return -2;
    }

    return -1;
}

/**
 * @brief 调用LLM进行智能整理 (v2.1)
 * @param state 药柜状态字符串
 * @param user_cmd 用户指令 (�?"把快过期的药放前�?)
 * @param response 响应缓冲�?
 * @param resp_size 缓冲区大�?
 * @return 响应长度, 负数=错误
 */
int w800_call_llm_organize(const char *state, const char *user_cmd,
                           char *response, uint32_t resp_size)
{
    if (!state || !user_cmd || !response) {
        return -1;
    }

    debug_println("[W800] ========== Smart Organize ==========");

    /* 1. 先发送药柜状�?*/
    int ret = w800_set_cabinet_state(state);
    if (ret < 0) {
        debug_println("[W800] Failed to set cabinet state");
        return ret;
    }

    /* 2. 发送用户指令进行LLM查询 */
    ret = w800_call_llm(user_cmd, response, resp_size);

    debug_println("[W800] ====================================");

    return ret;
}

/**
 * @brief 网络连通性测�?
 */
void w800_test_network(void)
{
    debug_println("[W800] Network test...");

    /* 使用较短超时，避免在主循环中长时间阻塞 */
    w800_status_t status = w800_get_status_with_timeout(200);
    switch (status) {
        case W800_STATUS_READY:
            debug_println("[W800] Status: READY (WiFi connected)");
            break;
        case W800_STATUS_BUSY:
            debug_println("[W800] Status: BUSY");
            break;
        case W800_STATUS_NO_WIFI:
            debug_println("[W800] Status: NO_WIFI");
            break;
        default:
            debug_println("[W800] Status: ERROR or no response");
            break;
    }
}

/* ========== UART回调 ========== */

void w800_rx_byte(uint8_t byte)
{
    bool line_is_json = g_line_is_json_cmd;
    bool line_done = false;

    /* 存入原始缓冲 */
    if (g_rx_idx < RX_BUFFER_SIZE - 1) {
        g_rx_buffer[g_rx_idx++] = byte;
        g_rx_buffer[g_rx_idx] = '\0';
    }

    /* 行缓冲处�?*/
    if (g_line_idx < RX_BUFFER_SIZE - 1) {
        if (g_line_idx == 0) {
            g_line_is_json_cmd = (byte == '{');
        }
        line_is_json = g_line_is_json_cmd;

        g_line_buffer[g_line_idx++] = byte;
        g_line_buffer[g_line_idx] = '\0';

        /* 检测行结束：兼�?CRLF �?LF */
        if (byte == '\n') {
            if (g_line_idx > 0) {
                /* 去除末尾 '\n' */
                g_line_idx--;
                g_line_buffer[g_line_idx] = '\0';
                /* 若前一字节�?'\r'，一并去�?*/
                if ((g_line_idx > 0) && (g_line_buffer[g_line_idx - 1] == '\r')) {
                    g_line_idx--;
                    g_line_buffer[g_line_idx] = '\0';
                }
            }
            line_done = true;
        }

        if (line_done) {
            /* 空行直接忽略 */
            if (g_line_idx == 0U) {
                g_line_buffer[0] = '\0';
                g_line_is_json_cmd = false;
                return;
            }

            /* JSON 命令分流:
             * 行首�?'{' 时按 TCP 透传命令处理�?
             * 其他行继续走原有 W800 响应流程 (OK/ERR/READY...)�?*/

            /* IP: 前缀 —�?W800 上报自身 IP，仅打印不进响应队列 */
            if (strncmp(g_line_buffer, "IP:", 3) == 0) {
                /* ISR-safe: 不在ISR中调用debug_print，改为设置标志由主循环打印 */
                strncpy(g_notify_ip_str, g_line_buffer + 3, sizeof(g_notify_ip_str) - 1);
                g_notify_ip_str[sizeof(g_notify_ip_str) - 1] = '\0';
                g_notify_got_ip = true;
                g_w800_got_ip = true;   /* WiFi已连接，IP已获�?*/
                g_line_idx = 0;
                g_line_buffer[0] = '\0';
                g_line_is_json_cmd = false;
                return;
            }

            /* MCDATA: 前缀 —�?W800 �?UDP 收到�?MC �?hex 编码后转发给 RA6M5 */
            if (strncmp(g_line_buffer, "MCDATA:", 7) == 0) {
                const char *hex = g_line_buffer + 7;
                while ((hex[0] != '\0') && (hex[1] != '\0')) {
                    int hi = (hex[0] >= 'A') ? (hex[0] - 'A' + 10) : (hex[0] - '0');
                    int lo = (hex[1] >= 'A') ? (hex[1] - 'A' + 10) : (hex[1] - '0');
                    uint8_t b = (uint8_t)(((uint8_t)hi << 4) | (uint8_t)lo);
                    maixcam_uart_rx_byte(b);
                    hex += 2;
                }
                g_line_idx = 0;
                g_line_buffer[0] = '\0';
                g_line_is_json_cmd = false;
                return;
            }

            if ((g_line_idx > 0) && (g_line_buffer[0] == '{')) {
                json_cmd_queue_push(g_line_buffer, g_line_idx);
                g_line_idx = 0;
                g_line_buffer[0] = '\0';
            } else {
                /* 将完成的行复制到专用缓冲，再重置行缓�?*/
                memcpy(g_completed_line_buf, g_line_buffer, g_line_idx + 1);
                g_completed_line_buf[g_line_idx] = '\0';
                g_line_complete = true;
                /* 重置行缓冲，使下一�?g_line_idx == 0，JSON检测正常工�?*/
                g_line_idx = 0;
                g_line_buffer[0] = '\0';
            }

            g_line_is_json_cmd = false;
        }
    }

    /* 数据回调 */
    if (g_data_callback && !line_is_json) {
        g_data_callback(&byte, 1);
    }
}

void w800_process_pending_cmd(void)
{
    char cmd_line[JSON_CMD_MAX_LEN];
    uint32_t dropped = json_cmd_take_drop_count();

    if (dropped > 0U) {
        debug_print("[W800] JSON cmd dropped: ");
        debug_print_int((int)dropped);
        debug_println("");
    }

    /* 每轮主循环只处理1条JSON命令，防止多条命令累积阻塞debug_has_line() */
    if (json_cmd_queue_pop(cmd_line, sizeof(cmd_line))) {
        watchdog_refresh();
        debug_print("[W800] JSON cmd dispatch: ");
        debug_println(cmd_line);
        w800_cmd_handle(cmd_line);
    }
}

void w800_poll_notifications(void)
{
    if (g_notify_got_ip) {
        g_notify_got_ip = false;
        debug_print("[W800] W800 IP: ");
        debug_println(g_notify_ip_str);
    }
}

