ujfadndna/arm-pharmacy-robot/LED_RTOS_keil/src/w800_driver.c
void w800_tx_complete(void)
{
    g_uart_tx_complete = true;
}

w800_state_t w800_get_state(void)
{
    w800_status_t status = w800_get_status();
    switch (status) {
        case W800_STATUS_READY:
            return W800_STATE_TRANSPARENT;
        case W800_STATUS_NO_WIFI:
            return W800_STATE_IDLE;
        default:
            return W800_STATE_ERROR;
    }
}

void w800_reset(void)
{
    g_internal_state = W800_IDLE;
    clear_rx_buffer();
    json_cmd_queue_reset();
    debug_println("[W800] Reset");
}

/**
 * @brief 硬件复位W800 (通过P508引脚)
 * @note  P508连接到W800的RESET引脚，低电平有效
 */
void w800_hardware_reset(void)
{
    debug_println("[W800] Hardware reset via P508...");

    /* 配置P508为输出模�?*/
    R_IOPORT_PinCfg(&g_ioport_ctrl, W800_RESET_PIN,
                    IOPORT_CFG_PORT_DIRECTION_OUTPUT | IOPORT_CFG_PORT_OUTPUT_HIGH);

    /* 输出低电�?(复位W800) */
    R_IOPORT_PinWrite(&g_ioport_ctrl, W800_RESET_PIN, BSP_IO_LEVEL_LOW);
    vTaskDelay(pdMS_TO_TICKS(50));  /* 保持50ms */

    /* 输出高电�?(释放复位) */
    R_IOPORT_PinWrite(&g_ioport_ctrl, W800_RESET_PIN, BSP_IO_LEVEL_HIGH);

    debug_println("[W800] Hardware reset done, waiting for boot...");

    /* 等待W800启动 */
    watchdog_refresh();
    vTaskDelay(pdMS_TO_TICKS(1000));
    watchdog_refresh();
    vTaskDelay(pdMS_TO_TICKS(1000));
    watchdog_refresh();

    /* 清空接收缓冲 */
    g_internal_state = W800_IDLE;
    g_w800_got_ip = false;
    clear_rx_buffer();
    json_cmd_queue_reset();
}

/* ========== 兼容旧接�?(保留但不推荐使用) ========== */

int w800_connect_wifi(const w800_wifi_config_t *config)
{
    if (!config || !config->ssid || !config->password) {
        return -1;
    }
    return w800_connect_wifi_direct(config->ssid, config->password);
}

int w800_connect_wifi_only(const char *ssid, const char *password)
{
    return w800_connect_wifi_direct(ssid, password);
}

int w800_disconnect_wifi(void)
{
    /* W800固件暂不支持断开WiFi命令 */
    debug_println("[W800] Disconnect not supported in direct mode");
    return 0;
}

int w800_send_udp(const uint8_t *data, uint32_t len)
{
    /* 直接协议模式不支持UDP */
    debug_println("[W800] UDP not supported in direct mode");
    return -1;
}

int w800_get_local_ip(char *ip_buf, uint32_t buf_len)
{
    /* 直接协议模式暂不支持获取IP */
    if (ip_buf && buf_len > 0) {
        strncpy(ip_buf, "N/A", buf_len);
    }
    return -1;
}

int W800_UART_Send(const uint8_t *data, uint32_t len)
{
    if ((data == NULL) || (len == 0U)) {
        return -1;
    }

    if (g_uart_tx_mutex != NULL) {
        if (xSemaphoreTake(g_uart_tx_mutex, pdMS_TO_TICKS(2000)) != pdTRUE) {
            return -1;  /* 超时，避免死锁 */
        }
    }

    g_uart_tx_complete = false;
    int result = -1;
    if (R_SCI_UART_Write(&g_uart6_ctrl, (uint8_t *)data, len) == FSP_SUCCESS) {
        wait_tx_complete();
        result = (int)len;
    }

    if (g_uart_tx_mutex != NULL) {
        xSemaphoreGive(g_uart_tx_mutex);
    }
    return result;
}

/* ========== MaixCam2 WiFi 透传接口 ========== */

int w800_mc_send(const uint8_t *data, uint32_t len)
{
    /* UDP:<HEX>\r\n  最�?128字节 �?256个hex字符 + "UDP:\r\n" = 262 */
    char cmd_buf[262];
    uint32_t i;
    uint32_t n;

    if ((data == NULL) || (len == 0U) || (len > 128U)) {
        return -1;
    }

    n = (uint32_t)snprintf(cmd_buf, sizeof(cmd_buf), "UDP:");
    for (i = 0U; i < len; i++) {
        cmd_buf[n++] = "0123456789ABCDEF"[(data[i] >> 4) & 0xFU];
        cmd_buf[n++] = "0123456789ABCDEF"[data[i] & 0xFU];
    }
    cmd_buf[n++] = '\r';
    cmd_buf[n++] = '\n';
    cmd_buf[n]   = '\0';

    return uart_send(cmd_buf);
}

/* ========== 调试接口 ========== */

static char g_debug_rx_buf[256];
static uint16_t g_debug_rx_idx = 0;

const char* w800_get_debug_rx(void)
{
    return g_debug_rx_buf;
}

void w800_clear_debug_rx(void)
{
    g_debug_rx_idx = 0;
    memset(g_debug_rx_buf, 0, sizeof(g_debug_rx_buf));
}

/* ========== UART6回调 (FSP配置) ========== */

void uart6_callback(uart_callback_args_t *p_args)
{
    if (p_args->event == UART_EVENT_TX_COMPLETE) {
        w800_tx_complete();
    }
    else if (p_args->event == UART_EVENT_RX_CHAR) {
        uint8_t byte = (uint8_t)p_args->data;
        w800_rx_byte(byte);

        /* 调试缓冲 */
        if (g_debug_rx_idx < sizeof(g_debug_rx_buf) - 1) {
            g_debug_rx_buf[g_debug_rx_idx++] = byte;
            g_debug_rx_buf[g_debug_rx_idx] = '\0';
        }
    }
}

